exports.help = (prefix,pushname) => {
	return `╭────.✪.────╮ 
┃Hola 👋🏻 
┃${pushname}
┃Bienvenid@ al menú
╰────.✪.────╯
╭────.✪.────╮
 https://youtube.com/c/turbontr1?sub_confirmatión=1
˖꒷꒦꒷˖⏝˖꒷꒦꒷˖⏝˖꒷꒦꒷˖⋆

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃❰❰❰✪INFO BOT✪❱❱❱
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}reglas
 ᳆͜͡➣ ${prefix}creador
 ᳆͜͡➣ ${prefix}info
 ᳆͜͡➣ ${prefix}bot
 ᳆͜͡➣  (simsimi)
 ᳆͜͡➣ ${prefix}report
 ᳆͜͡➣ ${prefix}ping
 ᳆͜͡➣ ${prefix}runtime
 ᳆͜͡➣ ${prefix}estado
 ᳆͜͡➣ ${prefix}soporte
 ᳆͜͡➣ ${prefix}Join
 ᳆͜͡➣ ${prefix}banlist
 ᳆͜͡➣  prefijo
╰────.✪.────╯
͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏͏
╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃➣͜͡᳆⃟⋆STICKER᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}sticker
 ᳆͜͡➣  (Foto/video)
 ᳆͜͡➣ ${prefix}take
 ᳆͜͡➣ (Nombre|Autor)
 ᳆͜͡➣ ${prefix}exif
 ᳆͜͡➣ (Nombre|Autor)
 ᳆͜͡➣ ${prefix}stickfg
 ᳆͜͡➣ ${prefix}jumbo
 ᳆͜͡➣ ${prefix}ttp
 ᳆͜͡➣ ${prefix}attp
 ᳆͜͡➣ ${prefix}smeme
 ᳆͜͡➣   _(txt|text2)
 ᳆͜͡➣ ${prefix}smeme2
 ᳆͜͡➣ ${prefix}toimg
 ᳆͜͡➣ ${prefix}togif
 ᳆͜͡➣ ${prefix}tovid
 ᳆͜͡➣ ${prefix}triggered
 ᳆͜͡➣ ${prefix}passed
 ᳆͜͡➣ ${prefix}wasted
 ᳆͜͡➣ ${prefix}sgay
 ᳆͜͡➣ ${prefix}srip
 ᳆͜͡➣ ${prefix}scelda
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃➣͜͡᳆⃟⋆Descargas᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}play
 ᳆͜͡➣ ${prefix}playvid
 ᳆͜͡➣ ${prefix}ytmp3
 ᳆͜͡➣ ${prefix}ytmp4
 ᳆͜͡➣ ${prefix}instagram
 ᳆͜͡➣ ${prefix}tiktok
 ᳆͜͡➣ ${prefix}tiktokaudio
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃➣͜͡᳆⃟BUSQUEDA᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}ytsearch
 ᳆͜͡➣ ${prefix}ytstalk
 ᳆͜͡➣ ${prefix}igstalk
 ᳆͜͡➣ ${prefix}Lyrics
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃᳆⃟EDUCACIÓN᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}covid
 ᳆͜͡➣ ${prefix}hora
 ᳆͜͡➣ ${prefix}encode
 ᳆͜͡➣ ${prefix}decode
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃  ➣͜͡᳆⃟MEDIA᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}tourl
 ᳆͜͡➣ ${prefix}toav
 ᳆͜͡➣ ${prefix}tomp3
 ᳆͜͡➣ ${prefix}wame
 ᳆͜͡➣ ${prefix}ocr
 ᳆͜͡➣ ${prefix}escribe
 ᳆͜͡➣ ${prefix}tinyurl
 ᳆͜͡➣  (a cortador)
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃  ➣͜͡᳆⃟⋆FUN᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}random
 ᳆͜͡➣ ${prefix}Leermas
 ᳆͜͡➣_(txt1|txt2)_
 ᳆͜͡➣ ${prefix}fake
 ᳆͜͡➣_(@tag|txt1|txt2)_
 ᳆͜͡➣ ${prefix}tagme
 ᳆͜͡➣ ${prefix}say
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃ ➣͜͡᳆⃟JUEGOS᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷ 
 ᳆͜͡➣ ${prefix}shipping
 ᳆͜͡➣ ${prefix}pregunta
 ᳆͜͡➣ ${prefix}verdad
 ᳆͜͡➣ ${prefix}reto
 ᳆͜͡➣ ${prefix}topgay
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃➣͜͡᳆⃟⋆Imagenes᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}imagen
 ᳆͜͡➣ ${prefix}pinterest
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃  ➣͜͡᳆⃟⋆GRUPO᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣︎︎ ${prefix}group
 ᳆͜͡➣ (Close/Open)
 ᳆͜͡➣ ${prefix}link
 ᳆͜͡➣ ${prefix}online
 ᳆͜͡➣ ${prefix}kick
 ᳆͜͡➣ ${prefix}okick
 ᳆͜͡➣ (reply msg)
 ᳆͜͡➣ ${prefix}staff
 ᳆͜͡➣ ${prefix}setdesc
 ᳆͜͡➣︎︎ ${prefix}setname
 ᳆͜͡➣︎︎ ${prefix}anularlink
 ᳆͜͡➣ ${prefix}perfil
 ᳆͜͡➣ ${prefix}leido
 ᳆͜͡➣ (Mensaje bot)
 ᳆͜͡➣ ${prefix}welcome
 ᳆͜͡➣ (on/off)
 ᳆͜͡➣︎︎ ${prefix}antilinkwha
 ᳆͜͡➣ (on/off)_
 ᳆͜͡➣ ${prefix}delete
 ᳆͜͡➣ (Mensaje bot)
 ᳆͜͡➣ ${prefix}salir
 ᳆͜͡➣ (dejo el grupo)
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃ ͜͡᳆⃟MENSIONES᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣︎︎ ${prefix}tagall
 ᳆͜͡➣ ${prefix}notify
 ᳆͜͡➣   (txt)
 ᳆͜͡➣︎︎ ${prefix}hidetag
╰────.✪.────╯

╭────.✪.────╮
┃➷➷➷➷➷➷➷➷➷
┃ ➣͜͡᳆⃟OWNER᳆͜͡➣
┃➷➷➷➷➷➷➷➷➷
 ᳆͜͡➣ ${prefix}Actualizar
 ᳆͜͡➣ ${prefix}privado
 ᳆͜͡➣ ${prefix}publico
 ᳆͜͡➣ ${prefix}setprefix
 ᳆͜͡➣ ${prefix}ban
 ᳆͜͡➣ ${prefix}unban
 ᳆͜͡➣ ${prefix}clearchat
 ᳆͜͡➣ ${prefix}listagp
 ᳆͜͡➣ ${prefix}informes
 ᳆͜͡➣ ${prefix}solicitudes
 ᳆͜͡➣ ${prefix}clonar
╰────.✪.────╯

╭╾┅≼☬≽.𓀬.≼☬≽┅╼╮
╽ ☬⋆✪𝐂𝐫𝐞𝐚𝐝𝐨𝐫𝐞𝐬✪⋆☬ ╽
╿☞𝐓𝐔𝐑𝐁𝐎☬𝐍𝐓𝐑✪.li ╿
╰╾┅≼☬≽.𓀬.≼☬≽┅╼╯
`
	
	} 